<a href="https://colab.research.google.com/github/DeepakR19/INTERNSOFTcodefiles/blob/main/Pandas2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

In [ ]:
pd.DataFrame([{'aa':1, 'bb':2}, {'bb':1, 'cc':1}])

    aa  bb   cc
0  1.0   2  NaN
1  NaN   1  1.0

In [ ]:
pd.DataFrame(np.random.randint(2, 67), columns=['John', 'Cena'], index=['a', 'b', 'c'])

   John  Cena
a    26    26
b    26    26
c    26    26

In [ ]:
i = pd.Index([1,2,3,4,5,6,7])
i

Int64Index([1, 2, 3, 4, 5, 6, 7], dtype='int64')

In [ ]:
i[3]

4

In [ ]:
i[::]

Int64Index([1, 2, 3, 4, 5, 6, 7], dtype='int64')

In [2]:
r = np.random.RandomState(10)
s = pd.Series(r.randint(0,4,400))
s

0      1
1      1
2      0
3      3
4      0
      ..
395    1
396    3
397    3
398    3
399    0
Length: 400, dtype: int64

In [3]:
np.exp(s)

0       2.718282
1       2.718282
2       1.000000
3      20.085537
4       1.000000
         ...
395     2.718282
396    20.085537
397    20.085537
398    20.085537
399     1.000000
Length: 400, dtype: float64

In [4]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')
print(area)
population

Alaska        1723337
Texas          695662
California     423967
Name: area, dtype: int64

California    38332521
Texas         26448193
New York      19651127
Name: population, dtype: int64

In [5]:
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [6]:
area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [7]:
A = pd.Series([25, 45, 5], index=[0, 1, 2])
B = pd.Series([13, 53, 75], index=[1, 2, 3])
print(A)
print(B)
B
A + B

0    25
1    45
2     5
dtype: int64
1    13
2    53
3    75
dtype: int64

0     NaN
1    58.0
2    58.0
3     NaN
dtype: float64

In [8]:
A.add(B, fill_value=0)

0    25.0
1    58.0
2    58.0
3    75.0
dtype: float64

In [12]:

data = {"Province": ["FL", "FL", "NH", "NH", "ZH"],
        "Year": [2013, 2014, 2013, 2014, 2014],
        "Literacy": [0.2, 0.1, 0.5, 0.3, 0.5]}
print(data)
data = pd.DataFrame(data)
data

{'Province': ['FL', 'FL', 'NH', 'NH', 'ZH'], 'Year': [2013, 2014, 2013, 2014, 2014], 'Literacy': [0.2, 0.1, 0.5, 0.3, 0.5]}

  Province  Year  Literacy
0       FL  2013       0.2
1       FL  2014       0.1
2       NH  2013       0.5
3       NH  2014       0.3
4       ZH  2014       0.5

In [13]:
df = pd.DataFrame(data, columns=["Year", "Province" ,"Literacy"])
df

   Year Province  Literacy
0  2013       FL       0.2
1  2014       FL       0.1
2  2013       NH       0.5
3  2014       NH       0.3
4  2014       ZH       0.5

In [14]:
df['nonsense'] = df.Year / df.Literacy
df

   Year Province  Literacy      nonsense
0  2013       FL       0.2  10065.000000
1  2014       FL       0.1  20140.000000
2  2013       NH       0.5   4026.000000
3  2014       NH       0.3   6713.333333
4  2014       ZH       0.5   4028.000000

In [16]:
df['Serie_aligned'] = pd.Series(range(5), index=[0,1,2, 3, 4])
df

   Year Province  Literacy      nonsense  Serie_aligned
0  2013       FL       0.2  10065.000000              0
1  2014       FL       0.1  20140.000000              1
2  2013       NH       0.5   4026.000000              2
3  2014       NH       0.3   6713.333333              3
4  2014       ZH       0.5   4028.000000              4

In [17]:
df

   Year Province  Literacy      nonsense  Serie_aligned
0  2013       FL       0.2  10065.000000              0
1  2014       FL       0.1  20140.000000              1
2  2013       NH       0.5   4026.000000              2
3  2014       NH       0.3   6713.333333              3
4  2014       ZH       0.5   4028.000000              4

In [18]:
df2 = pd.DataFrame({"Province": ["FL", "NH", "ZH"], "Population": ["100000", "200000", "300000"]})
df2

  Province Population
0       FL     100000
1       NH     200000
2       ZH     300000

In [19]:
df.merge(df2)

   Year Province  Literacy      nonsense  Serie_aligned Population
0  2013       FL       0.2  10065.000000              0     100000
1  2014       FL       0.1  20140.000000              1     100000
2  2013       NH       0.5   4026.000000              2     200000
3  2014       NH       0.3   6713.333333              3     200000
4  2014       ZH       0.5   4028.000000              4     300000

In [20]:
df3 = pd.DataFrame({"province": ["FL", "NH"], "Population": ["100000", "200000"]})
df3
df.merge(df3, right_on='province', left_on='Province')

   Year Province  Literacy      nonsense  Serie_aligned province Population
0  2013       FL       0.2  10065.000000              0       FL     100000
1  2014       FL       0.1  20140.000000              1       FL     100000
2  2013       NH       0.5   4026.000000              2       NH     200000
3  2014       NH       0.3   6713.333333              3       NH     200000

In [21]:
df4 = pd.DataFrame({"Province": ["FL", "NH", "UT"], "Population": ["100000", "200000", "50000"]})
df.merge(df4, how='outer')

     Year Province  Literacy      nonsense  Serie_aligned Population
0  2013.0       FL       0.2  10065.000000            0.0     100000
1  2014.0       FL       0.1  20140.000000            1.0     100000
2  2013.0       NH       0.5   4026.000000            2.0     200000
3  2014.0       NH       0.3   6713.333333            3.0     200000
4  2014.0       ZH       0.5   4028.000000            4.0        NaN
5     NaN       UT       NaN           NaN            NaN      50000

In [22]:
serie_a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
                     index=['f', 'e', 'd', 'c', 'b', 'a'])
serie_b = pd.Series(np.arange(len(serie_a), dtype=np.float64),
                 index=['f', 'e', 'd', 'c', 'b', 'a'])

In [25]:
print(serie_a)
print(serie_b)

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64
f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [26]:
pd.Series(np.where(pd.isnull(serie_a), serie_b, serie_a), index=serie_a.index)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64

In [27]:
serie_a.combine_first(serie_b)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64